read_verilog -sv <<EOT
module minimal_repro (
    input logic clk,
    output logic out
);
    logic condition;
    logic q1 = 1'bx; // Start with x
    
    always @(posedge clk) begin
        q1 <= 0;
    end

    assign condition = ~q1;

    always @(posedge clk) begin
        if (condition) begin
            // Do nothing: out_reg retains its previous value
        end else begin
            out <= 1'b1;
        end
    end
endmodule
EOT
show -prefix minimal_repro
write_verilog -noattr -sv minimal_repro-yosys.sv

sat -set-def-inputs -set-init-undef -prove out 1 -verify -seq 5 -prove-skip 1
